id: 860a62b6-58f3-469b-86a9-049ef992debf
name: ADF Pipeline Operations
description: Identifies ADF Pipeline operations.
severity: Medium
requiredDataConnectors:  
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 1
tactics:
  - Credential Access
  - Persistence
query:
let starttime = 24h;
let endtime = 1h;
let alertOperationThreshold = 2;
let OperationList = dynamic(
["Microsoft.DataFactory/factories/pipelines/write", "Microsoft.DataFactory/factories/pipelines/delete"]);
AzureActivity 
| where TimeGenerated between (ago(starttime) .. ago(endtime))
| where ResourceProvider == "Microsoft.DataFactory"
| where OperationNameValue in~ (OperationList)
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), ActivityTimeStamp = makelist(TimeGenerated), ActivityStatus = makelist(ActivityStatus), 
OperationIds = makelist(OperationId), CorrelationIds = makelist(CorrelationId), Resources = makelist(Resource), ResourceGroups = makelist(ResourceGroup), ResourceIds = makelist(ResourceId), ActivityCountByCallerIPAddress = count()  
by CallerIpAddress, Caller, OperationName
| where ActivityCountByCallerIPAddress >= alertOperationThreshold
| extend timestamp = StartTimeUtc, AccountCustomEntity = Caller, IPCustomEntity = CallerIpAddress
